docs: updated model onbaording doc
